#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


[0m[1mInitializing the backend...[0m

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v4.66.1

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
- Using previously-installed hashicorp/aws v4.66.1

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_ecr_repository.repo[0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository" "repo" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m image_tag_mutability = "MUTABLE"
      [32m+[0m[0m name                 = "simple-api-app-images"
      [32m+[0m[0m registry_id          = (known after apply)
      [32m+[0m[0m repository_url       = (known after apply)
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "creator" = "terraform"
          [32m+[0m[0m "env"     = "dev"
          [32m+[0m[0m "project" = "simple-app"
        }

      [32m+[0m[0m image_scanning_configuration {
          [32m+[0m[0m scan_on_push = true
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_cloudwatch_log_group.logs[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "logs" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m name              = "dev-cluster-logs"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "creator" = "terraform"
          [32m+[0m[0m "env"     = "dev"
          [32m+[0m[0m "project" = "simple-app"
        }
    }

[1m  # aws_ecs_cluster.cluster[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_cluster" "cluster" {
      [32m+[0m[0m arn                = (known after apply)
      [32m+[0m[0m capacity_providers = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "dev-cluster"
      [32m+[0m[0m tags_all           = {
          [32m+[0m[0m "creator" = "terraform"
          [32m+[0m[0m "env"     = "dev"
          [32m+[0m[0m "project" = "simple-app"
        }

      [32m+[0m[0m configuration {
          [32m+[0m[0m execute_command_configuration {
              [32m+[0m[0m kms_key_id = (known after apply)
              [32m+[0m[0m logging    = "OVERRIDE"

              [32m+[0m[0m log_configuration {
                  [32m+[0m[0m cloud_watch_encryption_enabled = true
                  [32m+[0m[0m cloud_watch_log_group_name     = "dev-cluster-logs"
                }
            }
        }
    }

[1m  # aws_kms_key.log_key[0m will be created
[0m  [32m+[0m[0m resource "aws_kms_key" "log_key" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m bypass_policy_lockout_safety_check = false
      [32m+[0m[0m customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      [32m+[0m[0m deletion_window_in_days            = 7
      [32m+[0m[0m description                        = "For Cloudwatch Logs"
      [32m+[0m[0m enable_key_rotation                = false
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m is_enabled                         = true
      [32m+[0m[0m key_id                             = (known after apply)
      [32m+[0m[0m key_usage                          = "ENCRYPT_DECRYPT"
      [32m+[0m[0m multi_region                       = (known after apply)
      [32m+[0m[0m policy                             = (known after apply)
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "creator" = "terraform"
          [32m+[0m[0m "env"     = "dev"
          [32m+[0m[0m "project" = "simple-app"
        }
    }

[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @jumana-s, Action: `pull_request`*